platformio/platform-ststm32/misc/svd/STM32WLE5_CM4.svd
            <register>
               <name>DR</name>
               <displayName>DR</displayName>
               <description>ADC data register</description>
               <addressOffset>0x40</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DATA</name>
                     <description>DATA</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>AWD2CR</name>
               <displayName>AWD2CR</displayName>
               <description>ADC Analog Watchdog 2 Configuration           register</description>
               <addressOffset>0xA0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>AWD2CH</name>
                     <description>AWD2CH</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>18</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>AWD3CR</name>
               <displayName>AWD3CR</displayName>
               <description>ADC Analog Watchdog 3 Configuration           register</description>
               <addressOffset>0xA4</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>AWD3CH</name>
                     <description>AWD3CH</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>18</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CALFACT</name>
               <displayName>CALFACT</displayName>
               <description>ADC Calibration factor</description>
               <addressOffset>0xB4</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CALFACT</name>
                     <description>CALFACT</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CCR</name>
               <displayName>CCR</displayName>
               <description>ADC common configuration           register</description>
               <addressOffset>0x308</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PRESC0</name>
                     <description>PRESC0</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PRESC1</name>
                     <description>PRESC1</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PRESC2</name>
                     <description>PRESC2</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PRESC3</name>
                     <description>PRESC3</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VREFEN</name>
                     <description>VREFEN</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TSEN</name>
                     <description>TSEN</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VBATEN</name>
                     <description>VBATEN</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
      <peripheral>
         <name>AES</name>
         <description>Advanced encryption standard hardware       accelerator 1</description>
         <groupName>AES</groupName>
         <baseAddress>0x58001800</baseAddress>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x400</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>AES</name>
            <description>AES global interrupt</description>
            <value>51</value>
         </interrupt>
         <registers>
            <register>
               <name>CR</name>
               <displayName>CR</displayName>
               <description>control register</description>
               <addressOffset>0x0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>NPBLB</name>
                     <description>Number of padding bytes in last block of               payload</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>KEYSIZE</name>
                     <description>Key size selection</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHMOD2</name>
                     <description>AES chaining mode Bit2</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GCMPH</name>
                     <description>Used only for GCM, CCM and GMAC               algorithms and has no effect when other algorithms               are selected</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>DMAOUTEN</name>
                     <description>Enable DMA management of data output               phase</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMAINEN</name>
                     <description>Enable DMA management of data input               phase</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ERRIE</name>
                     <description>Error interrupt enable</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CCFIE</name>
                     <description>CCF flag interrupt enable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ERRC</name>
                     <description>Error clear</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CCFC</name>
                     <description>Computation Complete Flag               Clear</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHMOD10</name>
                     <description>AES chaining mode Bit1               Bit0</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>MODE</name>
                     <description>AES operating mode</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>DATATYPE</name>
                     <description>Data type selection (for data in and               data out to/from the cryptographic               block)</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>EN</name>
                     <description>AES enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SR</name>
               <displayName>SR</displayName>
               <description>status register</description>
               <addressOffset>0x4</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BUSY</name>
                     <description>Busy flag</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WRERR</name>
                     <description>Write error flag</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RDERR</name>
                     <description>Read error flag</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CCF</name>
                     <description>Computation complete flag</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DINR</name>
               <displayName>DINR</displayName>
               <description>data input register</description>
               <addressOffset>0x8</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>AES_DINR</name>
                     <description>Data Input Register</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DOUTR</name>
               <displayName>DOUTR</displayName>
               <description>data output register</description>
               <addressOffset>0xC</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>AES_DOUTR</name>
                     <description>Data output register</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>KEYR0</name>
               <displayName>KEYR0</displayName>
               <description>key register 0</description>
               <addressOffset>0x10</addressOffset>
               <size>0x20</size>
               <access>write-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>AES_KEYR0</name>
                     <description>Data Output Register (LSB key               [31:0])</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>KEYR1</name>
               <displayName>KEYR1</displayName>
               <description>key register 1</description>
               <addressOffset>0x14</addressOffset>
               <size>0x20</size>
               <access>write-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>AES_KEYR1</name>
                     <description>AES key register (key               [63:32])</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>KEYR2</name>
               <displayName>KEYR2</displayName>
               <description>key register 2</description>
               <addressOffset>0x18</addressOffset>
               <size>0x20</size>
               <access>write-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>AES_KEYR2</name>
                     <description>AES key register (key               [95:64])</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>KEYR3</name>
               <displayName>KEYR3</displayName>
               <description>key register 3</description>
               <addressOffset>0x1C</addressOffset>
               <size>0x20</size>
               <access>write-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>AES_KEYR3</name>
                     <description>AES key register (MSB key               [127:96])</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IVR0</name>
               <displayName>IVR0</displayName>
               <description>initialization vector register           0</description>
               <addressOffset>0x20</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>AES_IVR0</name>
                     <description>initialization vector register (LSB IVR               [31:0])</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IVR1</name>
               <displayName>IVR1</displayName>
               <description>initialization vector register           1</description>
               <addressOffset>0x24</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>AES_IVR1</name>
                     <description>Initialization Vector Register (IVR               [63:32])</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IVR2</name>
               <displayName>IVR2</displayName>
               <description>initialization vector register           2</description>
               <addressOffset>0x28</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>AES_IVR2</name>
                     <description>Initialization Vector Register (IVR               [95:64])</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IVR3</name>
               <displayName>IVR3</displayName>
               <description>initialization vector register           3</description>
               <addressOffset>0x2C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>AES_IVR3</name>
                     <description>Initialization Vector Register (MSB IVR               [127:96])</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>KEYR4</name>
               <displayName>KEYR4</displayName>
               <description>key register 4</description>
               <addressOffset>0x30</addressOffset>
               <size>0x20</size>
               <access>write-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>AES_KEYR4</name>
                     <description>AES key register (MSB key               [159:128])</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>KEYR5</name>
               <displayName>KEYR5</displayName>
               <description>key register 5</description>
               <addressOffset>0x34</addressOffset>
               <size>0x20</size>
               <access>write-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>AES_KEYR5</name>
                     <description>AES key register (MSB key               [191:160])</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>KEYR6</name>
               <displayName>KEYR6</displayName>
               <description>key register 6</description>
               <addressOffset>0x38</addressOffset>
               <size>0x20</size>
               <access>write-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>AES_KEYR6</name>
                     <description>AES key register (MSB key               [223:192])</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>KEYR7</name>
               <displayName>KEYR7</displayName>
               <description>key register 7</description>
               <addressOffset>0x3C</addressOffset>
               <size>0x20</size>
               <access>write-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>AES_KEYR7</name>
                     <description>AES key register (MSB key               [255:224])</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SUSP0R</name>
               <displayName>SUSP0R</displayName>
               <description>AES suspend register 0</description>
               <addressOffset>0x40</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>AES_SUSP0R</name>
                     <description>AES suspend register 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SUSP1R</name>
               <displayName>SUSP1R</displayName>
               <description>AES suspend register 1</description>
               <addressOffset>0x44</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>AES_SUSP1R</name>
                     <description>AES suspend register 1</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SUSP2R</name>
               <displayName>SUSP2R</displayName>
               <description>AES suspend register 2</description>
               <addressOffset>0x48</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>AES_SUSP2R</name>
                     <description>AES suspend register 2</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SUSP3R</name>
               <displayName>SUSP3R</displayName>
               <description>AES suspend register 3</description>
               <addressOffset>0x4C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>AES_SUSP3R</name>
                     <description>AES suspend register 3</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
