platformio/platform-ststm32/misc/svd/STM32WLE5_CM4.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>DBGMCU</name>
         <description>Microcontroller Debug Unit</description>
         <groupName>DBGMCU</groupName>
         <baseAddress>0xE0042000</baseAddress>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x400</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>IDCODER</name>
               <displayName>IDCODER</displayName>
               <description>DBGMCU Identity Code Register</description>
               <addressOffset>0x0</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x10006497</resetValue>
               <fields>
                  <field>
                     <name>DEV_ID</name>
                     <description>Device ID</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
                  <field>
                     <name>REV_ID</name>
                     <description>Revision</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CR</name>
               <displayName>CR</displayName>
               <description>DBGMCU Configuration Register</description>
               <addressOffset>0x4</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DBG_SLEEP</name>
                     <description>Allow debug in SLEEP mode</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DBG_STOP</name>
                     <description>Allow debug in STOP mode</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DBG_STANDBY</name>
                     <description>Allow debug in STANDBY               mode</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>APB1FZR1</name>
               <displayName>APB1FZR1</displayName>
               <description>DBGMCU CPU1 APB1 Peripheral Freeze Register           1</description>
               <addressOffset>0x3C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DBG_TIM2_STOP</name>
                     <description>TIM2 stop in CPU1 debug</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DBG_RTC_STOP</name>
                     <description>RTC stop in CPU1 debug</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DBG_WWDG_STOP</name>
                     <description>WWDG stop in CPU1 debug</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DBG_IWDG_STOP</name>
                     <description>IWDG stop in CPU1 debug</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DBG_I2C1_STOP</name>
                     <description>I2C1 SMBUS timeout stop in CPU1               debug</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DBG_I2C2_STOP</name>
                     <description>I2C2 SMBUS timeout stop in CPU1               debug</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DBG_I2C3_STOP</name>
                     <description>I2C3 SMBUS timeout stop in CPU1               debug</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DBG_LPTIM1_STOP</name>
                     <description>LPTIM1 stop in CPU1 debug</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>APB1FZR2</name>
               <displayName>APB1FZR2</displayName>
               <description>DBGMCU CPU1 APB1 Peripheral Freeze Register           2</description>
               <addressOffset>0x44</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DBG_LPTIM2_STOP</name>
                     <description>DBG_LPTIM2_STOP</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DBG_LPTIM3_STOP</name>
                     <description>DBG_LPTIM3_STOP</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>APB2FZR</name>
               <displayName>APB2FZR</displayName>
               <description>DBGMCU CPU1 APB2 Peripheral Freeze           Register</description>
               <addressOffset>0x4C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DBG_TIM1_STOP</name>
                     <description>DBG_TIM1_STOP</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DBG_TIM16_STOP</name>
                     <description>DBG_TIM16_STOP</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DBG_TIM17_STOP</name>
                     <description>DBG_TIM17_STOP</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
