platformio/platform-ststm32/misc/svd/STM32WLE5_CM4.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>PWR</name>
         <description>Power control</description>
         <groupName>PWR</groupName>
         <baseAddress>0x58000400</baseAddress>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x400</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
			<register>
			  <name>CR1</name>
			  <displayName>CR1</displayName>
			  <description>Power control register 1</description>
			  <addressOffset>0x0</addressOffset>
			  <size>0x20</size>
			  <access>read-write</access>
			  <resetValue>0x00000200</resetValue>
			  <fields>
				<field>
				  <name>LPR</name>
				  <description>Low-power run</description>
				  <bitOffset>14</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
				<field>
				  <name>VOS</name>
				  <description>Voltage scaling range               selection</description>
				  <bitOffset>9</bitOffset>
				  <bitWidth>2</bitWidth>
				</field>
				<field>
				  <name>DBP</name>
				  <description>Disable backup domain write               protection</description>
				  <bitOffset>8</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
				<field>
				  <name>FPDS</name>
				  <description>Flash memory power down mode during               LPSleep for CPU1</description>
				  <bitOffset>5</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
				<field>
				  <name>FPDR</name>
				  <description>Flash memory power down mode during               LPRun for CPU1</description>
				  <bitOffset>4</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
				<field>
				  <name>SUBGHZSPINSSSEL</name>
				  <description>sub-GHz SPI NSS source select</description>
				  <bitOffset>3</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
				<field>
				  <name>LPMS</name>
				  <description>Low-power mode selection for               CPU1</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>3</bitWidth>
				</field>
			  </fields>
			</register>
            <register>
               <name>CR2</name>
               <displayName>CR2</displayName>
               <description>Power control register 2</description>
               <addressOffset>0x4</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PVME3</name>
                     <description>Peripheral voltage monitoring 3 enable:               VDDA vs. 1.62V</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PLS</name>
                     <description>Power voltage detector level               selection.</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>PVDE</name>
                     <description>Power voltage detector               enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CR3</name>
               <displayName>CR3</displayName>
               <description>Power control register 3</description>
               <addressOffset>0x8</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00008000</resetValue>
               <fields>
                  <field>
                     <name>EIWUL</name>
                     <description>Enable internal wakeup line for               CPU1</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EWRFIRQ</name>
                     <description>akeup for CPU1</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EWRFBUSY</name>
                     <description>Enable Radio BUSY Wakeup from Standby               for CPU1</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>APC</name>
                     <description>Apply pull-up and pull-down               configuration from CPU1</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RRS</name>
                     <description>SRAM2 retention in Standby               mode</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EWPVD</name>
                     <description>Enable wakeup PVD for CPU1</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EULPEN</name>
                     <description>Ultra-low-power enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EWUP3</name>
                     <description>Enable Wakeup pin WKUP3 for               CPU1</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EWUP2</name>
                     <description>Enable Wakeup pin WKUP2 for               CPU1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EWUP1</name>
                     <description>Enable Wakeup pin WKUP1 for               CPU1</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CR4</name>
               <displayName>CR4</displayName>
               <description>Power control register 4</description>
               <addressOffset>0xC</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>WRFBUSYP</name>
                     <description>Wakeup Radio BUSY polarity</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VBRS</name>
                     <description>VBAT battery charging resistor               selection</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VBE</name>
                     <description>VBAT battery charging               enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WP3</name>
                     <description>Wakeup pin WKUP3 polarity</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WP2</name>
                     <description>Wakeup pin WKUP2 polarity</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WP1</name>
                     <description>Wakeup pin WKUP1 polarity</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SR1</name>
               <displayName>SR1</displayName>
               <description>Power status register 1</description>
               <addressOffset>0x10</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>WUFI</name>
                     <description>Internal wakeup interrupt               flag</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WRFBUSYF</name>
                     <description>Radio BUSY wakeup flag</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPVDF</name>
                     <description>Wakeup PVD flag</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WUF3</name>
                     <description>Wakeup flag 3</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WUF2</name>
                     <description>Wakeup flag 2</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WUF1</name>
                     <description>Wakeup flag 1</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SR2</name>
               <displayName>SR2</displayName>
               <description>Power status register 2</description>
               <addressOffset>0x14</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PVMO3</name>
                     <description>Peripheral voltage monitoring output:               VDDA vs. 1.62 V</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PVDO</name>
                     <description>Power voltage detector               output</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VOSF</name>
                     <description>Voltage scaling flag</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>REGLPF</name>
                     <description>regulator1 low power flag</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>REGLPS</name>
                     <description>regulator1 started</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FLASHRDY</name>
                     <description>Flash ready</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>REGMRS</name>
                     <description>regulator2 low power flag</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
				  <field>
                     <name>RFEOLF</name>
                     <description>Radio end of life flag</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LDORDY</name>
                     <description>LDO ready flag</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SMPSRDY</name>
                     <description>SMPS ready flag</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RFBUSYMS</name>
                     <description>Radio BUSY masked signal               status</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RFBUSYS</name>
                     <description>Radio BUSY signal status</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SCR</name>
               <displayName>SCR</displayName>
               <description>Power status clear register</description>
               <addressOffset>0x18</addressOffset>
               <size>0x20</size>
               <access>write-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CWRFBUSYF</name>
                     <description>Clear wakeup Radio BUSY               flag</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CWPVDF</name>
                     <description>Clear wakeup PVD interrupt               flag</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CWUF3</name>
                     <description>Clear wakeup flag 3</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CWUF2</name>
                     <description>Clear wakeup flag 2</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CWUF1</name>
                     <description>Clear wakeup flag 1</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CR5</name>
               <displayName>CR5</displayName>
               <description>Power control register 5</description>
               <addressOffset>0x1C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SMPSEN</name>
                     <description>Enable SMPS Step Down converter SMPS               mode enabled.</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RFEOLEN</name>
                     <description>Enable Radio End Of Life detector               enabled</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PUCRA</name>
               <displayName>PUCRA</displayName>
               <description>Power Port A pull-up control           register</description>
               <addressOffset>0x20</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PU15</name>
                     <description>Port PA15 pull-up</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
				  <field>
                     <name>PU14</name>
                     <description>PU14</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PU13</name>
                     <description>Port PA[y] pull-up bit y (y=0 to               13)</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PU12</name>
                     <description>PU12</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PU11</name>
                     <description>PU11</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PU10</name>
                     <description>PU10</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PU9</name>
                     <description>PU9</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PU8</name>
                     <description>PU8</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PU7</name>
                     <description>PU7</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PU6</name>
                     <description>PU6</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PU5</name>
                     <description>PU5</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PU4</name>
                     <description>PU4</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PU3</name>
                     <description>PU3</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PU2</name>
                     <description>PU2</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PU1</name>
                     <description>PU1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PU0</name>
                     <description>PU0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
