platformio/platform-ststm32/misc/svd/STM32WLE5_CM4.svd
            <register>
               <name>PDCRA</name>
               <displayName>PDCRA</displayName>
               <description>Power Port A pull-down control           register</description>
               <addressOffset>0x24</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
			      <field>
                     <name>PD15</name>
                     <description>PD15</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PD14</name>
                     <description>ull-down</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
				    <field>
                     <name>PD13</name>
                     <description>PD13</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PD12</name>
                     <description>Port PA[y] pull-down (y=0 to               12)</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PD11</name>
                     <description>PD11</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PD10</name>
                     <description>PD10</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PD9</name>
                     <description>PD9</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PD8</name>
                     <description>PD8</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PD7</name>
                     <description>PD7</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PD6</name>
                     <description>PD6</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PD5</name>
                     <description>PD5</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PD4</name>
                     <description>PD4</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PD3</name>
                     <description>PD3</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PD2</name>
                     <description>PD2</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PD1</name>
                     <description>PD1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PD0</name>
                     <description>PD0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PUCRB</name>
               <displayName>PUCRB</displayName>
               <description>Power Port B pull-up control           register</description>
               <addressOffset>0x28</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PU15</name>
                     <description>Port PB[y] pull-up (y=0 to               15)</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PU14</name>
                     <description>PU14</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PU13</name>
                     <description>PU13</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PU12</name>
                     <description>PU12</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PU11</name>
                     <description>PU11</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PU10</name>
                     <description>PU10</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PU9</name>
                     <description>PU9</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PU8</name>
                     <description>PU8</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PU7</name>
                     <description>PU7</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PU6</name>
                     <description>PU6</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PU5</name>
                     <description>PU5</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PU4</name>
                     <description>PU4</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PU3</name>
                     <description>PU3</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PU2</name>
                     <description>PU2</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PU1</name>
                     <description>PU1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PU0</name>
                     <description>PU0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PDCRB</name>
               <displayName>PDCRB</displayName>
               <description>Power Port B pull-down control           register</description>
               <addressOffset>0x2C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PD15</name>
                     <description>Port PB[y] pull-down (y=5 to               15)</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PD14</name>
                     <description>PD14</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PD13</name>
                     <description>PD13</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PD12</name>
                     <description>PD12</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PD11</name>
                     <description>PD11</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PD10</name>
                     <description>PD10</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PD9</name>
                     <description>PD9</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PD8</name>
                     <description>PD8</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PD7</name>
                     <description>PD7</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PD6</name>
                     <description>PD6</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PD5</name>
                     <description>PD5</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
				  <field>
                     <name>PD4</name>
                     <description>PD4</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PD3</name>
                     <description>Port PB[y] pull-down (y=0 to               3)</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PD2</name>
                     <description>PD2</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PD1</name>
                     <description>PD1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PD0</name>
                     <description>PD0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PUCRC</name>
               <displayName>PUCRC</displayName>
               <description>Power Port C pull-up control           register</description>
               <addressOffset>0x30</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PU15</name>
                     <description>Port PC[y] pull-up (y=13 to               15)</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PU14</name>
                     <description>PU14</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PU13</name>
                     <description>PU13</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PU2</name>
                     <description>PU2</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PU1</name>
                     <description>PU1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PU0</name>
                     <description>PU0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PU3</name>
                     <description>PU3</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PU4</name>
                     <description>PU4</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PU5</name>
                     <description>PU5</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PU6</name>
                     <description>PU6</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PDCRC</name>
               <displayName>PDCRC</displayName>
               <description>Power Port C pull-down control           register</description>
               <addressOffset>0x34</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PD15</name>
                     <description>Port PC[y] pull-down (y=13 to               15)</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PD14</name>
                     <description>PD14</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PD13</name>
                     <description>PD13</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PD2</name>
                     <description>PD2</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PD1</name>
                     <description>PD1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PD0</name>
                     <description>PD0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PD3</name>
                     <description>PD3</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PD4</name>
                     <description>PD4</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PD5</name>
                     <description>PD5</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PD6</name>
                     <description>PD6</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PUCRH</name>
               <displayName>PUCRH</displayName>
               <description>Power Port H pull-up control           register</description>
               <addressOffset>0x58</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PU3</name>
                     <description>pull-up</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PDCRH</name>
               <displayName>PDCRH</displayName>
               <description>Power Port H pull-down control           register</description>
               <addressOffset>0x5C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PD3</name>
                     <description>pull-down</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>EXTSCR</name>
               <displayName>EXTSCR</displayName>
               <description>Power extended status and status clear           register</description>
               <addressOffset>0x88</addressOffset>
               <size>0x20</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>C1DS</name>
                     <description>CPU1 deepsleep mode</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>C1STOPF</name>
                     <description>System Stop0, 1 flag for CPU1. (All core               states retained)</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>C1STOP2F</name>
                     <description>System Stop2 flag for CPU1. (partial               core states retained)</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>C1SBF</name>
                     <description>System Standby flag for CPU1. (no core               states retained)</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>C1CSSF</name>
                     <description>Clear CPU1 Stop Standby               flags</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>SUBGHZSPICR</name>
               <displayName>SUBGHZSPICR</displayName>
               <description>Power SPI3 control register</description>
               <addressOffset>0x90</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00008000</resetValue>
               <fields>
                  <field>
                     <name>NSS</name>
                     <description>sub-GHz SPI NSS control</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
