platformio/platform-ststm32/misc/svd/STM32WLE5_CM4.svd
            <register>
               <name>AHB3SMENR</name>
               <displayName>AHB3SMENR</displayName>
               <description>AHB3 peripheral clocks enable in Sleep and           Stop modes register</description>
               <addressOffset>0x70</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x03870000</resetValue>
               <fields>
                  <field>
                     <name>FLASHSMEN</name>
                     <description>Flash interface clock enable during CPU1               CSleep mode.</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SRAM2SMEN</name>
                     <description>SRAM2 memory interface clock enable               during CPU1 CSleep mode</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SRAM1SMEN</name>
                     <description>SRAM1 interface clock enable during CPU1               CSleep mode.</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RNGSMEN</name>
                     <description>True RNG clocks enable during CPU1               Csleep and CStop modes</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AESSMEN</name>
                     <description>AES accelerator clock enable during CPU1               CSleep mode.</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PKASMEN</name>
                     <description>PKA accelerator clock enable during CPU1               CSleep mode.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>APB1SMENR1</name>
               <displayName>APB1SMENR1</displayName>
               <description>APB1 peripheral clocks enable in Sleep mode           register 1</description>
               <addressOffset>0x78</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0xA0E24C01</resetValue>
               <fields>
                  <field>
                     <name>LPTIM1SMEN</name>
                     <description>Low power timer 1 clock enable during               CPU1 Csleep and CStop mode</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DACSMEN</name>
                     <description>DAC clock enable during CPU1 CSleep               mode.</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>I2C3SMEN</name>
                     <description>I2C3 clock enable during CPU1 Csleep and               CStop modes</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>I2C2SMEN</name>
                     <description>I2C2 clock enable during CPU1 Csleep and               CStop modes</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>I2C1SMEN</name>
                     <description>I2C1 clock enable during CPU1 Csleep and               CStop modes</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USART2SMEN</name>
                     <description>USART2 clock enable during CPU1 CSleep               mode.</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SPI2S2SMEN</name>
                     <description>SPI2S2 clock enable during CPU1 CSleep               mode.</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WWDGSMEN</name>
                     <description>Window watchdog clocks enable during               CPU1 CSleep mode.</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RTCAPBSMEN</name>
                     <description>RTC bus clock enable during CPU1 CSleep               mode.</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIM2SMEN</name>
                     <description>TIM2 timer clock enable during CPU1               CSleep mode.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>APB1SMENR2</name>
               <displayName>APB1SMENR2</displayName>
               <description>APB1 peripheral clocks enable in Sleep mode           register 2</description>
               <addressOffset>0x7C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000061</resetValue>
               <fields>
                  <field>
                     <name>LPTIM3SMEN</name>
                     <description>Low power timer 3 clock enable during               CPU1 Csleep and CStop modes</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LPTIM2SMEN</name>
                     <description>Low power timer 2 clock enable during               CPU1 Csleep and CStop modes</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LPUART1SMEN</name>
                     <description>Low power UART 1 clock enable during               CPU1 Csleep and CStop modes.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>APB2SMENR</name>
               <displayName>APB2SMENR</displayName>
               <description>APB2 peripheral clocks enable in Sleep mode           register</description>
               <addressOffset>0x80</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00065A00</resetValue>
               <fields>
                  <field>
                     <name>TIM17SMEN</name>
                     <description>TIM17 timer clock enable during CPU1               CSleep mode.</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIM16SMEN</name>
                     <description>TIM16 timer clock enable during CPU1               CSleep mode.</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USART1SMEN</name>
                     <description>USART1 clock enable during CPU1 Csleep               and CStop modes.</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SPI1SMEN</name>
                     <description>SPI1 clock enable during CPU1 CSleep               mode.</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIM1SMEN</name>
                     <description>TIM1 timer clock enable during CPU1               CSleep mode.</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ADCSMEN</name>
                     <description>ADC clocks enable during CPU1 Csleep and               CStop modes</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>APB3SMENR</name>
               <displayName>APB3SMENR</displayName>
               <description>APB3 peripheral clock enable in Sleep mode           register</description>
               <addressOffset>0x84</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x000000001</resetValue>
               <fields>
                  <field>
                     <name>SUBGHZSPISMEN</name>
                     <description>Sub-GHz radio SPI clock enable during Sleep and Stop modes</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CCIPR</name>
               <displayName>CCIPR</displayName>
               <description>Peripherals independent clock configuration           register</description>
               <addressOffset>0x88</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RNGSEL</name>
                     <description>RNG clock source selection</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>ADCSEL</name>
                     <description>ADC clock source selection</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>LPTIM3SEL</name>
                     <description>Low power timer 3 clock source               selection</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>LPTIM2SEL</name>
                     <description>Low power timer 2 clock source               selection</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>LPTIM1SEL</name>
                     <description>Low power timer 1 clock source               selection</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>I2C3SEL</name>
                     <description>I2C3 clock source               selection</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>I2C2SEL</name>
                     <description>I2C2 clock source               selection</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>I2C1SEL</name>
                     <description>I2C1 clock source               selection</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>LPUART1SEL</name>
                     <description>LPUART1 clock source               selection</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>SPI2S2SEL</name>
                     <description>SPI2S2 I2S clock source               selection</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>USART2SEL</name>
                     <description>USART2 clock source               selection</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>USART1SEL</name>
                     <description>USART1 clock source               selection</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BDCR</name>
               <displayName>BDCR</displayName>
               <description>Backup domain control register</description>
               <addressOffset>0x90</addressOffset>
               <size>0x20</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>LSCOSEL</name>
                     <description>Low speed clock output               selection</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>LSCOEN</name>
                     <description>Low speed clock output               enable</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>BDRST</name>
                     <description>Backup domain software               reset</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>RTCEN</name>
                     <description>RTC clock enable</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>LSESYSRDY</name>
                     <description>LSE system clock ready</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>RTCSEL</name>
                     <description>RTC clock source selection</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>LSESYSEN</name>
                     <description>LSE system clock enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>LSECSSD</name>
                     <description>CSS on LSE failure               Detection</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>LSECSSON</name>
                     <description>CSS on LSE enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>LSEDRV</name>
                     <description>LSE oscillator drive               capability</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>LSEBYP</name>
                     <description>LSE oscillator bypass</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>LSERDY</name>
                     <description>LSE oscillator ready</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>LSEON</name>
                     <description>LSE oscillator enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>CSR</name>
               <displayName>CSR</displayName>
               <description>Control/status register</description>
               <addressOffset>0x94</addressOffset>
               <size>0x20</size>
               <resetValue>0x0C01C600</resetValue>
               <fields>
                  <field>
                     <name>LPWRRSTF</name>
                     <description>Low-power reset flag</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>WWDGRSTF</name>
                     <description>Window watchdog reset flag</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>IWDGRSTF</name>
                     <description>Independent window watchdog reset               flag</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>SFTRSTF</name>
                     <description>Software reset flag</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>BORRSTF</name>
                     <description>BOR flag</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>PINRSTF</name>
                     <description>Pin reset flag</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>OBLRSTF</name>
                     <description>Option byte loader reset               flag</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>RFILARSTF</name>
                     <description>Radio illegal access flag</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>RMVF</name>
                     <description>Remove reset flag</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>RFRST</name>
                     <description>Radio reset</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>RFRSTF</name>
                     <description>Radio in reset status flag</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>MSISRANGE</name>
                     <description>MSI clock ranges</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-write</access>
                  </field>
				  <field>
                     <name>LSIPRE</name>
                     <description>LSI frequency prescaler</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>LSIRDY</name>
                     <description>LSI oscillator ready</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>LSION</name>
                     <description>LSI oscillator enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
