platformio/platform-ststm32/misc/svd/STM32WLE5_CM4.svd
			<register>
			  <name>ALRMBR</name>
			  <displayName>ALRMBR</displayName>
			  <description>ALRMBR</description>
			  <addressOffset>0x48</addressOffset>
			  <size>0x20</size>
			  <access>read-write</access>
			  <resetValue>0x00000000</resetValue>
			  <fields>
				<field>
				  <name>MSK4</name>
				  <description>Alarm B date mask</description>
				  <bitOffset>31</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
				<field>
				  <name>WDSEL</name>
				  <description>Week day selection</description>
				  <bitOffset>30</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
				<field>
				  <name>DT</name>
				  <description>Date tens in BCD format</description>
				  <bitOffset>28</bitOffset>
				  <bitWidth>2</bitWidth>
				</field>
				<field>
				  <name>DU</name>
				  <description>Date units or day in BCD               format</description>
				  <bitOffset>24</bitOffset>
				  <bitWidth>4</bitWidth>
				</field>
				<field>
				  <name>MSK3</name>
				  <description>Alarm B hours mask</description>
				  <bitOffset>23</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
				<field>
				  <name>PM</name>
				  <description>AM/PM notation</description>
				  <bitOffset>22</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
				<field>
				  <name>HT</name>
				  <description>Hour tens in BCD format</description>
				  <bitOffset>20</bitOffset>
				  <bitWidth>2</bitWidth>
				</field>
				<field>
				  <name>HU</name>
				  <description>Hour units in BCD format</description>
				  <bitOffset>16</bitOffset>
				  <bitWidth>4</bitWidth>
				</field>
				<field>
				  <name>MSK2</name>
				  <description>Alarm B minutes mask</description>
				  <bitOffset>15</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
				<field>
				  <name>MNT</name>
				  <description>Minute tens in BCD format</description>
				  <bitOffset>12</bitOffset>
				  <bitWidth>3</bitWidth>
				</field>
				<field>
				  <name>MNU</name>
				  <description>Minute units in BCD format</description>
				  <bitOffset>8</bitOffset>
				  <bitWidth>4</bitWidth>
				</field>
				<field>
				  <name>MSK1</name>
				  <description>Alarm B seconds mask</description>
				  <bitOffset>7</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
				<field>
				  <name>ST</name>
				  <description>Second tens in BCD format</description>
				  <bitOffset>4</bitOffset>
				  <bitWidth>3</bitWidth>
				</field>
				<field>
				  <name>SU</name>
				  <description>Second units in BCD format</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>4</bitWidth>
				</field>
			  </fields>
			</register>
			<register>
			  <name>ALRMBSSR</name>
			  <displayName>ALRMBSSR</displayName>
			  <description>ALRMBSSR</description>
			  <addressOffset>0x4C</addressOffset>
			  <size>0x20</size>
			  <access>read-write</access>
			  <resetValue>0x00000000</resetValue>
			  <fields>
				<field>
				  <name>SSCLR</name>
				  <description>Clear synchronous counter on alarm (Binary mode only)</description>
				  <bitOffset>31</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
				<field>
				  <name>MASKSS</name>
				  <description>Mask the most-significant bits starting               at this bit</description>
				  <bitOffset>24</bitOffset>
				  <bitWidth>6</bitWidth>
				</field>
				<field>
				  <name>SS</name>
				  <description>Sub seconds value</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>15</bitWidth>
				</field>
			  </fields>
			</register>
			<register>
			  <name>SR</name>
			  <displayName>SR</displayName>
			  <description>SR</description>
			  <addressOffset>0x50</addressOffset>
			  <size>0x20</size>
			  <access>read-only</access>
			  <resetValue>0x00000000</resetValue>
			  <fields>
				<field>
				  <name>SSRUF</name>
				  <description>SSR underflow flag</description>
				  <bitOffset>6</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
				<field>
				  <name>ITSF</name>
				  <description>Internal timestamp flag</description>
				  <bitOffset>5</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
				<field>
				  <name>TSOVF</name>
				  <description>Timestamp overflow flag</description>
				  <bitOffset>4</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
				<field>
				  <name>TSF</name>
				  <description>Timestamp flag</description>
				  <bitOffset>3</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
				<field>
				  <name>WUTF</name>
				  <description>Wakeup timer flag</description>
				  <bitOffset>2</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
				<field>
				  <name>ALRBF</name>
				  <description>Alarm B flag</description>
				  <bitOffset>1</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
				<field>
				  <name>ALRAF</name>
				  <description>Alarm A flag</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
			  </fields>
			</register>
			<register>
			  <name>MISR</name>
			  <displayName>MISR</displayName>
			  <description>MISR</description>
			  <addressOffset>0x54</addressOffset>
			  <size>0x20</size>
			  <access>read-only</access>
			  <resetValue>0x00000000</resetValue>
			  <fields>
				<field>
				  <name>SSRUMF</name>
				  <description>SSR underflow masked flag</description>
				  <bitOffset>6</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
				<field>
				  <name>ITSMF</name>
				  <description>Internal timestamp masked               flag</description>
				  <bitOffset>5</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
				<field>
				  <name>TSOVMF</name>
				  <description>Timestamp overflow masked               flag</description>
				  <bitOffset>4</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
				<field>
				  <name>TSMF</name>
				  <description>Timestamp masked flag</description>
				  <bitOffset>3</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
				<field>
				  <name>WUTMF</name>
				  <description>Wakeup timer masked flag</description>
				  <bitOffset>2</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
				<field>
				  <name>ALRBMF</name>
				  <description>Alarm B masked flag</description>
				  <bitOffset>1</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
				<field>
				  <name>ALRAMF</name>
				  <description>Alarm A masked flag</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
			  </fields>
			</register>
			<register>
			  <name>SCR</name>
			  <displayName>SCR</displayName>
			  <description>SCR</description>
			  <addressOffset>0x5C</addressOffset>
			  <size>0x20</size>
			  <access>write-only</access>
			  <resetValue>0x00000000</resetValue>
			  <fields>
				<field>
				  <name>CSSRUF</name>
				  <description>Clear SSR underflow flag</description>
				  <bitOffset>6</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
				<field>
				  <name>CITSF</name>
				  <description>Clear internal timestamp               flag</description>
				  <bitOffset>5</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
				<field>
				  <name>CTSOVF</name>
				  <description>Clear timestamp overflow               flag</description>
				  <bitOffset>4</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
				<field>
				  <name>CTSF</name>
				  <description>Clear timestamp flag</description>
				  <bitOffset>3</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
				<field>
				  <name>CWUTF</name>
				  <description>Clear wakeup timer flag</description>
				  <bitOffset>2</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
				<field>
				  <name>CALRBF</name>
				  <description>Clear alarm B flag</description>
				  <bitOffset>1</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
				<field>
				  <name>CALRAF</name>
				  <description>Clear alarm A flag</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
			  </fields>
			</register>
			<register>
			  <name>ALRABINR</name>
			  <displayName>ALRABINR</displayName>
			  <description>RTC alarm A binary mode           register</description>
			  <addressOffset>0x70</addressOffset>
			  <size>0x20</size>
			  <access>read-write</access>
			  <resetValue>0x00000000</resetValue>
			  <fields>
				<field>
				  <name>SS</name>
				  <description>Synchronous counter alarm value in               Binary mode</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>32</bitWidth>
				</field>
			  </fields>
			</register>
			<register>
			  <name>ALRBBINR</name>
			  <displayName>ALRBBINR</displayName>
			  <description>RTC alarm B binary mode           register</description>
			  <addressOffset>0x74</addressOffset>
			  <size>0x20</size>
			  <access>read-write</access>
			  <resetValue>0x00000000</resetValue>
			  <fields>
				<field>
				  <name>SS</name>
				  <description>Synchronous counter alarm value in               Binary mode</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>32</bitWidth>
				</field>
			  </fields>
			</register>
