platformio/platform-ststm32/misc/svd/STM32WLE5_CM4.svd
            <register>
               <name>SWPR</name>
               <displayName>SWPR</displayName>
               <description>SWPR</description>
               <addressOffset>0x20</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>P31WP</name>
                     <description>SRAM2 1Kbyte page 31 write               protection</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>P30WP</name>
                     <description>SRAM2 1Kbyte page 30 write               protection</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>P29WP</name>
                     <description>SRAM2 1Kbyte page 29 write               protection</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>P28WP</name>
                     <description>SRAM2 1Kbyte page 28 write               protection</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>P27WP</name>
                     <description>SRAM2 1Kbyte page 27 write               protection</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>P26WP</name>
                     <description>SRAM2 1Kbyte page 26 write               protection</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>P25WP</name>
                     <description>SRAM2 1Kbyte page 25 write               protection</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>P24WP</name>
                     <description>SRAM2 1Kbyte page 24 write               protection</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>P23WP</name>
                     <description>SRAM2 1Kbyte page 23 write               protection</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>P22WP</name>
                     <description>SRAM2 1Kbyte page 22 write               protection</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>P21WP</name>
                     <description>SRAM2 1Kbyte page 21 write               protection</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>P20WP</name>
                     <description>SRAM2 1Kbyte page 20 write               protection</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>P19WP</name>
                     <description>SRAM2 1Kbyte page 19 write               protection</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>P18WP</name>
                     <description>SRAM2 1Kbyte page 18 write               protection</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>P17WP</name>
                     <description>SRAM2 1Kbyte page 17 write               protection</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>P16WP</name>
                     <description>SRAM2 1Kbyte page 16 write               protection</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>P15WP</name>
                     <description>SRAM2 1Kbyte page 15 write               protection</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>P14WP</name>
                     <description>SRAM2 1Kbyte page 14 write               protection</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>P13WP</name>
                     <description>SRAM2 1Kbyte page 13 write               protection</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>P12WP</name>
                     <description>SRAM2 1Kbyte page 12 write               protection</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>P11WP</name>
                     <description>SRAM2 1Kbyte page 11 write               protection</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>P10WP</name>
                     <description>SRAM2 1Kbyte page 10 write               protection</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>P9WP</name>
                     <description>SRAM2 1Kbyte page 9 write               protection</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>P8WP</name>
                     <description>SRAM2 1Kbyte page 8 write               protection</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>P7WP</name>
                     <description>SRAM2 1Kbyte page 7 write               protection</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>P6WP</name>
                     <description>SRAM2 1Kbyte page 6 write               protection</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>P5WP</name>
                     <description>SRAM2 1Kbyte page 5 write               protection</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>P4WP</name>
                     <description>SRAM2 1Kbyte page 4 write               protection</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>P3WP</name>
                     <description>SRAM2 1Kbyte page 3 write               protection</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>P2WP</name>
                     <description>SRAM2 1Kbyte page 2 write               protection</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>P1WP</name>
                     <description>SRAM2 1Kbyte page 1 write               protection</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>P0WP</name>
                     <description>SRAM2 1Kbyte page 0 write               protection</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SKR</name>
               <displayName>SKR</displayName>
               <description>SKR</description>
               <addressOffset>0x24</addressOffset>
               <size>0x20</size>
               <access>write-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>KEY</name>
                     <description>SRAM2 write protection key for software               erase</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
			<register>
               <name>RFDCR</name>
               <displayName>RFDCR</displayName>
               <description>radio debug control register</description>
               <addressOffset>0x208</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RFTBSEL</name>
                     <description>radio debug test bus selection</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
